DataProcessors/ГантКонструкторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ГантКонструкторов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПлановоеЗначениеПроектирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПлановоеЗначениеПроектирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВКалендарных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончанияВРабочих</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланРазработкиВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ГантКонструкторов/Forms/Форма/Ext/Form/Module.bsl
Перем тзЦвета, ДанныеТочки, ПустаяДата;

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьГантНаСервере();
	Диаграмма.ОтображатьЛегенду = Ложь;
КонецПроцедуры

#КонецОбласти 

#Область Диаграмма
	
Процедура ОбновитьГантНаСервере(Обновить = Ложь)
	
	Если НЕ Обновить Тогда
		Диаграмма.Очистить();
	КонецЕсли;
	
	Диаграмма.Обновление = Ложь;

	стПараметры = Новый Структура("Диаграмма, тзДанныеГанта, Проект, Конструктор, Подразделение, ВыводитьПроект, Обновить"
		, Диаграмма, тзДанныеГанта, Проект, Конструктор, Подразделение, ВыводитьПроект, Обновить);
		
	омГантКонструкторовНаСервере.ОбновитьГантНаСервере(стПараметры);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры 

Процедура ОбновитьПроектНаСервере(ТекущийПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, Конструктор, тзДанныеГанта, Подразделение, ВыводитьПроект, Обновить"
		, Диаграмма, ТекущийПроект, Конструктор, тзДанныеГанта, Подразделение, ВыводитьПроект, Истина);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиПроект(стПараметры, ТекущийПроект);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры


Процедура ОбновитьИсполнителяНаСервере(ТекущийИсполнитель, ТекущийПроект)
	
	стПараметры = Новый Структура("Диаграмма, Проект, тзДанныеГанта, Подразделение, ВыводитьПроект, Обновить"
		, Диаграмма, ТекущийПроект, тзДанныеГанта, Подразделение, ВыводитьПроект, Истина);
	
	Диаграмма.Обновление = Ложь;
	омГантКонструкторовНаСервере.ВывестиИсполнитель(стПараметры, ТекущийИсполнитель);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ИзменениеФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сотрудник") Тогда
		Если ТипЗнч(Параметры.Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
			Конструктор 	= омСотрудники.ПолучитьСотруднткаПоПользователю(Параметры.Сотрудник);
		Иначе
			Конструктор 	= Параметры.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Проект") Тогда
		Проект 		= Параметры.Проект;
	КонецЕсли;
	
	Если НЕ (РольДоступна("ГлавныйКонструктор") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		
		Элементы.Подразделение.Видимость 	= Ложь;
		Элементы.Конструктор.ТолькоПросмотр = Истина;
		ЭтаФорма.ТолькоПросмотр 			= Истина;
		
	КонецЕсли;
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	//ВыводитьПроект				= Истина;
	
	ОбновитьГантНаСервере();

КонецПроцедуры

#КонецОбласти 

#Область ИзменениеРеквизитов
	
&НаКлиенте
Процедура ВыводитьПроектПриИзменении(Элемент)
	ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьГантНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Интервал.Начало = НачалоДня(Интервал.Начало);
	
	Если Интервал.Начало < НачалоДня(ТекущаяДата()) Тогда
		ОтменаРедактирования = Истина;		
		Возврат;
	КонецЕсли;
	
	Продолжительность = ?(Интервал.Расшифровка.Продолжительность = 0, 1, Интервал.Расшифровка.Продолжительность);
	Интервал.Конец 	= омДаты.ДобавитьДниСУчетомВыходных(Интервал.Начало, Продолжительность);
	
	Если Интервал.Расшифровка.Свойство("Задача") Тогда
		ЗаписатьИзменениеВРегистр(Интервал.Начало, Интервал.Расшифровка.Задача, Продолжительность);
		
		Для каждого х Из тзДанныеГанта Цикл
			Если Интервал.Расшифровка.Задача = х.Задача И Интервал.Расшифровка.Этап = х.Этап Тогда
				х.ДатаНачала = Интервал.Начало;
				
				ОбновитьПроектНаСервере(Интервал.Расшифровка.Проект);
				ОбновитьИсполнителяНаСервере(Интервал.Расшифровка.Исполнитель, Интервал.Расшифровка.Проект);

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область ЗаписьВРегистры

&НаСервереБезКонтекста
Процедура ЗаписатьИзменениеВРегистр(Начало, Задача, Продолжительность)
	
	МенеджерЗаписи = РегистрыСведений.ПлановоеЗначениеПроектирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача 				= Задача;
	МенеджерЗаписи.Период 				= ТекущаяДата();
	МенеджерЗаписи.Автор 				= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ДатаНачала 			= Начало;
	МенеджерЗаписи.ПланРазработкиВДнях 	= Продолжительность;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	
	СтандартнаяОбработка = Ложь;
	
	Для каждого текЭлемент Из Расшифровки Цикл
		
		Если текЭлемент = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		Если текЭлемент.Свойство("Задача") Тогда
			
			Если ЗначениеЗаполнено(текЭлемент.Задача) Тогда
				ПоказатьЗначение(,текЭлемент.Задача);	
			КонецЕсли;	
			
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	Если Тип("ТочкаДиаграммыГанта") = ТипЗнч(Значения) Тогда
		Если Тип("СправочникСсылка.ИзделияКомплект") = ТипЗнч(Значения.Значение) ИЛИ 
			Тип("СправочникСсылка.Композиции") = ТипЗнч(Значения.Значение) ИЛИ
			Тип("СправочникСсылка.Проекты") = ТипЗнч(Значения.Значение) Тогда
				СтандартнаяОбработка = Ложь;
				ПоказатьЗначение(,Значения.Значение);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
